cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Brew
brew "asdf"
brew "bitwarden-cli"
brew "bottom"
brew "clipboard"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "direnv"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gdu"
brew "git"
brew "gnupg"
brew "grep"
brew "gzip"
brew "jq"
brew "jump"
brew "lazygit"
brew "mas"
brew "neofetch"
brew "neovim"
brew "p7zip"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "wget"
brew "z"
brew "zsh"

# Cask
cask "alacritty", args: { no_quarantine: true }
cask "amethyst"
cask "background-music"
cask "bitwarden"
cask "blackhole-16ch"
cask "brave-browser"
cask "cleanmymac"
cask "docker"
cask "firefox"
cask "karabiner-elements"
cask "obsidian"
cask "raycast"
cask "spaceid", args: { no_quarantine: true }
cask "spotify"
cask "the-unarchiver"
cask "wireshark"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-ia-writer-mono"

# App Store
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835

# VSCode
vscode "Catppuccin.catppuccin-vsc"
vscode "equinusocio.vsc-material-theme-icons"
vscode "EditorConfig.EditorConfig"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "mhutchie.git-graph"
vscode "donjayamanne.githistory"
vscode "codezombiech.gitignore"
vscode "golang.go"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
